app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `user_profile`
WHERE `gender` = 'male'
SELECT COUNT(*) AS `numrows`
FROM `user_profile`
WHERE `gender` = 'female'
---
    public function admin()
    {
        $user_model = new UserModel();
        $year_level = new YearModel();
        $profile_model = new ProfileModel();
        $registration_model = new RegistrationModel();
        $male = $this->db->table('user_profile')->where('gender', 'male')->countAllResults();
        $female = $this->db->table('user_profile')->where('gender', 'female')->countAllResults();