app/Controllers/PreEnrolled.php

SELECT *
FROM `user_tbl`
WHERE `email` = 'admin@gmail.com'
SELECT *, `student_registration`.`id`
FROM `user_profile`
INNER JOIN `user_tbl` ON `user_profile`.`email` = `user_tbl`.`email`
INNER JOIN `student_registration` ON `user_tbl`.`lrn` = `student_registration`.`lrn`
WHERE `student_registration`.`id` = '99'
AND `student_registration`.`year` = '2024-2025'
AND `student_registration`.`semester` = '1st Semester'
SELECT *, `student_registration`.`id`
FROM `section_tbl`
INNER JOIN `strand_tbl` ON `section_tbl`.`strand_id` = `strand_tbl`.`id`
INNER JOIN `student_registration` ON `strand_tbl`.`strand`=`student_registration`.`strand`
INNER JOIN `student_registration` as `sr` ON `section_tbl`.`year_level` = `sr`.`year_level`
INNER JOIN `school_year` ON `sr`.`year` = `school_year`.`year`
WHERE `student_registration`.`semester` = '1st Semester'
AND `student_registration`.`id` = '99'
AND `school_year`.`year` = '2024-2025'
GROUP BY `section_tbl`.`section`
---
    public function viewPreEnroll($id)
    {
        $user_profile = new ProfileModel();
        $user_model = new UserModel();
        $registration_model = new RegistrationModel();

        $data = [
            'enrolled' => $registration_model
        ->select('*, student_registration.id')->join('school_year', 'student_registration.semester=school_year.semester', 'right')
        ->join('user_tbl', 'student_registration.lrn=user_tbl.lrn', 'right')
        ->join('user_profile', 'user_tbl.email=user_profile.email', 'right')
        ->join('strand_tbl', 'student_registration.strand = strand_tbl.strand', 'right')
        ->join('section_tbl', 'strand_tbl.id = section_tbl.strand_id', 'right')
        ->join('student_registration as s', 'section_tbl.year_level = s.year_level', 'inner')
        ->where('student_registration.semester', session()->get('semester'))
        ->where('user_profile.id', $id)
        ->where('school_year.year', session()->get('year'))->get()->getResultArray(),

        'userName' => $user_model->where('email', $email = session()->get('loggedInUser'))->find(),
            'rejected' => $registration_model
        ->select('*')->join('school_year', 'student_registration.semester=school_year.semester', 'right')
        ->join('user_tbl', 'student_registration.lrn=user_tbl.lrn', 'right')
        ->join('user_profile', 'user_tbl.email=user_profile.email', 'right')
        ->join('student_registration as s', 'user_tbl.lrn=s.lrn', 'right')
        ->where('student_registration.semester', session()->get('semester'))
        ->where('user_profile.id', $id)
        ->where('school_year.year', session()->get('year'))->first(),

SELECT *
FROM `user_tbl`
WHERE `email` = 'test@gmail.com'
SELECT *
FROM `student_registration`
RIGHT JOIN `school_year` ON `student_registration`.`semester`=`school_year`.`semester`
RIGHT JOIN `user_tbl` ON `student_registration`.`lrn`=`user_tbl`.`lrn`
RIGHT JOIN `user_profile` ON `user_tbl`.`email`=`user_profile`.`email`
WHERE `student_registration`.`semester` = '1st semester'
AND `school_year`.`year` = '2022'
---
    public function enroll($id)
    {
        $user_profile = new ProfileModel();
        $user_model = new UserModel();
        $lrn = $this->request->getPost('lrn');
        $registration_model = new RegistrationModel();

        $data = [
            'pre_enrolled' => $registration_model
        ->select('*')->join('school_year', 'student_registration.semester=school_year.semester', 'right')
        ->join('user_tbl', 'student_registration.lrn=user_tbl.lrn', 'right')
        ->join('user_profile', 'user_tbl.email=user_profile.email', 'right')
        ->join('strand_tbl', 'student_registration.strand = strand_tbl.strand', 'right')
        ->join('section_tbl', 'strand_tbl.id = section_tbl.strand_id', 'right')
        ->join('student_registration as s', 'user_tbl.lrn=s.lrn', 'right')
        ->where('student_registration.semester', session()->get('semester'))
        ->where('user_profile.id', $id)
        ->where('school_year.year', session()->get('year'))->first(),

        'userName' => $user_model->where('email', $email = session()->get('loggedInUser'))->find(),
        ];

SELECT *
FROM `student_registration`
RIGHT JOIN `school_year` ON `student_registration`.`semester`=`school_year`.`semester`
RIGHT JOIN `user_tbl` ON `student_registration`.`lrn`=`user_tbl`.`lrn`
RIGHT JOIN `user_profile` ON `user_tbl`.`email`=`user_profile`.`email`
WHERE `student_registration`.`semester` = '1st semester'
AND `school_year`.`year` = '2022'
SELECT *
FROM `user_tbl`
WHERE `email` = 'admin@gmail.com'
---
    public function pre_enrolled_reg()
    {
        $registration_model = new RegistrationModel();
        $user_model = new UserModel();
        $data ['pre_enrolled'] = $registration_model
        ->select('*')
        ->join('school_year', 'student_registration.semester=school_year.semester', 'right')
        ->join('user_tbl', 'student_registration.lrn=user_tbl.lrn', 'right')
        ->join('user_profile', 'user_tbl.email=user_profile.email', 'right')
        ->where('student_registration.semester', session()->get('semester'))
        ->where('school_year.year', session()->get('year'))
        ->get()->getResultArray();


        $data['userName'] = $user_model->where('email', $email = session()->get('loggedInUser'))->find();

SELECT *, `user_tbl`.`id`
FROM `student_registration`
RIGHT JOIN `school_year` ON `student_registration`.`semester`=`school_year`.`semester`
RIGHT JOIN `user_tbl` ON `student_registration`.`lrn`=`user_tbl`.`lrn`
RIGHT JOIN `user_profile` ON `user_tbl`.`email`=`user_profile`.`email`
WHERE `student_registration`.`year` = '2024-2025'
AND `school_year`.`year` = '2024-2025'
AND `school_year`.`semester` = '2nd Semester'
---
    public function enrolled($id)
    {
        $registration_model = new RegistrationModel();
        $section_model = new SectionModel();

        $state = $this->request->getPost('state');
        $section = $this->request->getPost('section');
        $section_id =  $section_model->where('section', $section)->first();

    $value = [
        'state' => $state,
        'user_section' => $section_id['id']
    ];

    $registration_model->update($id, $value);
    $session = session();

    $email_data  = $registration_model
    ->select('*')
    ->join('school_year', 'student_registration.semester=school_year.semester', 'right')
    ->join('user_tbl', 'student_registration.lrn=user_tbl.lrn', 'right')
    ->join('user_profile', 'user_tbl.email=user_profile.email', 'right')
    ->where('student_registration.id', $id)
    ->where('student_registration.semester', session()->get('semester'))
    ->where('school_year.year', session()->get('year'))
    ->first();