app/Controllers/Profile.php

    public function userProspectus()
    {
        $profile_model = new ProfileModel();
        $user_model = new UserModel();
        $registration_model = new RegistrationModel();
        $prospectus_model = new ProspectusModel();
        $subject = $registration_model->where('state', 'Enrolled')->first();
        $user = [
            'userName' => $user_model->where('email', $email = session()->get('loggedInUser'))->find(),
            'profile_picture' => $user_model->where('email', $email = session()->get('loggedInUser'))->findAll()
        ];
        if(!$subject){
            $user = [
                'userName' => $user_model->where('email', $email = session()->get('loggedInUser'))->find(),
                'profile_picture' => $user_model->where('email', $email = session()->get('loggedInUser'))->findAll(),
                'subject' => $prospectus_model->findAll(),
            ];
            // var_dump($user['subject']);
            // return view('user/userProspectus', $user);
            return redirect()->route('registration');
        }
        else{
            $user = [
                'subject' => $registration_model->select('*')
                ->join('user_tbl', 'student_registration.lrn = user_tbl.lrn', 'right')
                ->join('strand_tbl', 'student_registration.strand = strand_tbl.strand', 'right')
                ->join('prospectrus_tbl', 'strand_tbl.id = prospectrus_tbl.strand_id')
                ->where('student_registration.lrn', session()->get('lrn'))
                ->get()->getResultArray(),
                'userName' => $user_model->where('email', $email = session()->get('loggedInUser'))->find(),
                'profile_picture' => $user_model->where('email', $email = session()->get('loggedInUser'))->findAll()
---
SELECT *
FROM `user_tbl`
RIGHT JOIN `user_profile` ON `user_tbl`.`email` = `user_profile`.`email`
WHERE `user_tbl`.`email` = 'reyondarandell842@gmail.com'

    public function retrieve_profile($emailvoid = null)
    {
        $registration_model = new RegistrationModel();
        $profile_model = new ProfileModel();
        $email = session()->get('loggedInUser');
        $profile = $profile_model->where('email', $email)->findAll();


        $user_model = new UserModel();
        $user_profile = [
            'userName' => $user_model->where('email', $email = session()->get('loggedInUser'))->find(),
            'profile_picture' => $user_model->where('email', $email = session()->get('loggedInUser'))->findAll(),
            'profileUpdate' => $profile_model->where('email', $email)->findAll(),
            'student_registration' => $registration_model->select('*')
            ->join('user_tbl', 'student_registration.lrn = user_tbl.lrn', 'right')
            ->where('student_registration.lrn', session()->get('lrn'))
            ->first()
        ];

        if(count($profile) != 0)
        {
            $user_model = new UserModel();
            $user_profile['userInfo'] = $user_model->select('*')
                ->join('user_profile', 'user_tbl.email = user_profile.email', 'right')
                ->where('user_tbl.email', $email)->get()->getResultArray();
---
SELECT *
FROM `user_profile`
WHERE `email` = 'reyondarandell842@gmail.com'
SELECT *
FROM `student_registration`
RIGHT JOIN `user_tbl` ON `student_registration`.`lrn` = `user_tbl`.`lrn`
WHERE `student_registration`.`lrn` = '110554070039'
 LIMIT 1
SELECT *
FROM `user_tbl`
RIGHT JOIN `user_profile` ON `user_tbl`.`email` = `user_profile`.`email`
WHERE `user_tbl`.`email` = 'reyondarandell842@gmail.com'