app/Controllers/Profile.php

SELECT *
FROM `user_profile`
WHERE `email` = 'joseph.salavaria.cusi06@gmail.com'
SELECT *
FROM `user_tbl`
RIGHT JOIN `user_profile` ON `user_tbl`.`email` = `user_profile`.`email`
WHERE `user_tbl`.`email` = 'joseph.salavaria.cusi06@gmail.com'
SELECT *
FROM `user_profile`
WHERE `email` = 'reyondarandell842@gmail.com'
SELECT *
FROM `user_tbl`
WHERE `email` = 'joseph.salavaria.cusi06@gmail.com'
 LIMIT 1
---
    public function retrieve_profile($email = null)
    {
        $profile_model = new ProfileModel();
        $profile = $profile_model->where('email', $email)->find();

        $profile_model = new ProfileModel();
        $user_profile['profile_picture'] = $profile_model->where('email', $email = session()->get('loggedInUser'))->findAll();


        if(count($profile) != 0)
        {
            $user_model = new UserModel();
            $user_profile['userInfo'] = $user_model->select('*')
                ->join('user_profile', 'user_tbl.email = user_profile.email', 'right')
                ->where('user_tbl.email', $email)->get()->getResultArray();
            return view('user/userdashboard', $user_profile);

        }
        else
        {
            $user_model = new UserModel();
            $user_profile['userInfo'] = $user_model->where('email', $email)->first();