app/Controllers/Prospectus.php

    public function strandProspectus11($strand = null)
    {
        $prospectus_model = new ProspectusModel();
        $strand_model = new StrandModel();
        $user_model = new UserModel();
        $year_model = new YearModel();

        $data = $user_model->where('email', session()->get('loggedInUser'))->first();

          if($data['status'] == "SHS"){
            $strand_id = $strand_model->where('strand', $strand)->find();
            $data = [
                'prospectus' => $prospectus_model->select('*, prospectrus_tbl.id')
                    ->join('strand_tbl', 'prospectrus_tbl.strand_id = strand_tbl.id', 'right')
                    ->join('school_year', 'prospectrus_tbl.semester = school_year.semester', 'inner')
                    ->where('strand_id', $strand_id[0]['id'])
                    ->where('prospectrus_tbl.year_level', 'Grade 11')
                    ->get()->getResultArray(),
                'userName' => $user_model->where('email', $email = session()->get('loggedInUser'))->find(),

                'sem_year' => $year_model->first()
---
SELECT *, `prospectrus_tbl`.`id`
FROM `prospectrus_tbl`
RIGHT JOIN `strand_tbl` ON `prospectrus_tbl`.`strand_id` = `strand_tbl`.`id`
WHERE `prospectrus_tbl`.`strand_id` = '6'

    public function prospectus11()
    {
      $prospectus_model = new ProspectusModel();
      $year_model = new YearModel();
      $strand_model = new StrandModel();
      $user_model = new UserModel();

      $data = $user_model->where('email', session()->get('loggedInUser'))->first();


      if($data['status'] == "SHS"){
        session()->setFlashdata('strand', 'gas');
        $strand_id = $strand_model->where('strand', 'GAS')->find();
        $values = [
            'prospectus' => $prospectus_model->select('*, prospectrus_tbl.id' )
                ->join('strand_tbl', 'prospectrus_tbl.strand_id = strand_tbl.id', 'right')
                ->join('school_year', 'prospectrus_tbl.semester = school_year.semester', 'inner')
                ->where('prospectrus_tbl.strand_id', $strand_id[0]['id'])
                ->where('prospectrus_tbl.year_level', 'Grade 11')
                ->get()->getResultArray(),
            'userName' => $user_model->where('email', $email = session()->get('loggedInUser'))->find(),
            'sem_year' => $year_model->first(),
---
SELECT *
FROM `user_tbl`
WHERE `email` = 'admin@gmail.com'
SELECT *, `prospectrus_tbl`.`id`
FROM `prospectrus_tbl`
RIGHT JOIN `strand_tbl` ON `prospectrus_tbl`.`strand_id` = `strand_tbl`.`id`
WHERE `prospectrus_tbl`.`strand_id` = '2'
SELECT *
FROM `strand_tbl`
WHERE `strand` = 'HUMSS'