app/Controllers/Section.php

    public function schedule11($year_levels, $id, $strand) {

        $schedule = session()->get('schedule_data');
        $semester = empty($schedule['semester'])?'':$schedule['semester'];
        $year = empty($schedule['year'])?'':$schedule['year'];
        session()->remove('schedule_data');

        $yearlvl = str_replace('-', ' ', $year_levels);
        $user_model = new UserModel();
        $year_model = new YearModel();
        $schedule_model = new ScheduleModel();
        $section_model = new SectionModel();
        $prospectus_model = new ProspectusModel();
        $year_level_model = new YearlevelModel();

        $data = $user_model->where('email', session()->get('loggedInUser'))->first();
        $year_level = $data['status'] == 'SHS' ?
            ($yearlvl ==  'Grade 11' ? 'Grade 11' :
                ($yearlvl ==  'Grade 12' ? 'Grade 12' : 'Unknow Level'
                )
            ) :
            ($yearlvl ==  '1st Year' ? '1st Year' :
                ($yearlvl ==  '2nd Year' ? '2nd Year' :
                    ($yearlvl ==  '3rd Year' ? '3rd Year' :
                        ($yearlvl ==  '4th Year' ? '4th Year' : 'Unknow Level'
                    )
                    )
                )
            );
        $data = [
          'userName' => $user_model->where('email', session()->get('loggedInUser'))->find(),

          'sched' => $schedule_model
          ->select('*, schedule_tbl.id')
          ->join('section_tbl', 'schedule_tbl.section_id = section_tbl.id', 'inner')
          ->join('prospectrus_tbl', 'schedule_tbl.subject_id = prospectrus_tbl.id', 'inner')
          ->where('section_tbl.section', str_replace('-', ' ', $id))
          ->where('section_tbl.year_level', $year_level)
          ->where('schedule_tbl.year', empty($year)?session()->get('year'):$year)
          ->where('schedule_tbl.semester', empty($semester)?session()->get('semester'):$semester)
          ->get()
          ->getResultArray(),

          'sched_years' => $schedule_model
          ->select('*, schedule_tbl.id')
          ->join('section_tbl', 'schedule_tbl.section_id = section_tbl.id', 'inner')
          ->join('prospectrus_tbl', 'schedule_tbl.subject_id = prospectrus_tbl.id', 'inner')
          ->groupby('schedule_tbl.year')
          ->where('section_tbl.section', str_replace('-', ' ', $id))
          ->where('section_tbl.year_level', $year_level)
---
SELECT *, `prospectrus_tbl`.`id`
FROM `prospectrus_tbl`
INNER JOIN `strand_tbl` ON `prospectrus_tbl`.`strand_id` = `strand_tbl`.`id`
INNER JOIN `section_tbl` ON `strand_tbl`.`id` = `section_tbl`.`strand_id`
WHERE `section_tbl`.`id` = '14'
AND `prospectrus_tbl`.`year_level` = 'Grade 11'