app/Controllers/Section.php

SELECT *
FROM `user_tbl`
WHERE `usertype` = 'teacher'
SELECT *
FROM `section_tbl`
WHERE `id` = '14'
---
    public function schedule($id){
      $user_model = new UserModel();
      $schedule_model = new ScheduleModel();
      $section_model = new SectionModel();
      $prospectus_model = new ProspectusModel();
      $data = [
        'userName' => $user_model->where('email', $email = session()->get('loggedInUser'))->find(),
        'sched' => $schedule_model
        ->select('*, schedule_tbl.id')
        ->join('section_tbl', 'schedule_tbl.section_id = section_tbl.id', 'inner')
        ->join('prospectrus_tbl', 'schedule_tbl.subject_id = prospectrus_tbl.id', 'inner')
        ->where('section_tbl.id', $id)
        ->get()->getResultArray(),

        'teacher' => $user_model->where('usertype', 'teacher')->findAll(),
        'subject' => $prospectus_model
        ->select('*, prospectrus_tbl.id')
        ->join('strand_tbl', 'prospectrus_tbl.strand_id = strand_tbl.id', 'inner')
        ->join('section_tbl', 'strand_tbl.id = section_tbl.strand_id', 'inner')
        ->where('section_tbl.id', $id)
        ->get()->getResultArray(),
        'section' => $section_model->where('id', $id)->findAll(),